# Data Exploration with Pandas
<table><tr><td>
<img src="https://resizing.flixster.com/Grjhpv0wcwgi-uhfaC3QM8KFglY=/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzdmOWE4MWFiLWVlOWMtNDA4Mi05OTA0LTRiNjMxNTEwMzk1MC5qcGc=" height=300><a href="https://resizing.flixster.com/Grjhpv0wcwgi-uhfaC3QM8KFglY=/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzdmOWE4MWFiLWVlOWMtNDA4Mi05OTA0LTRiNjMxNTEwMzk1MC5qcGc=">source</a></td><td><img src="https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRQCHfe9VV3K3Efxv5PYQ_6NYpB20WkKS1zW21UEUmhW1lalECnbwTH3nwQL8XprEMTUCtPeA" height=300><a href="https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcRQCHfe9VV3K3Efxv5PYQ_6NYpB20WkKS1zW21UEUmhW1lalECnbwTH3nwQL8XprEMTUCtPeA">source</a></td></tr></table>

In [2]:
# importing the package(s) we want to use
import pandas as pd

### Let's explore the movies data set more! ###
We'll use the `pd.read_csv()` function to read the csv file into a DataFrame.

In [3]:
csvFile = 'https://raw.githubusercontent.com/csbfx/advpy122-data/master/top_movies_2020.csv'

movies = pd.read_csv(csvFile)
movies.head()

                                Title      Gross  Gross (Adjusted)  Year
0                  Gone with the Wind  200852579        1895421694  1939
1  Star Wars: Episode IV - A New Hope  460998507        1668979715  1977
2                  The Sound of Music  159287539        1335086324  1965
3          E.T. the Extra-Terrestrial  435110554        1329174791  1982
4                             Titanic  659363944        1270101626  1997

### Initial data exploration

We can examine the contents of the resultant DataFrame using the `head()` and `tail()` commands:

In [4]:
### Take a look at the top 3 values of the file
movies.head(3)

                                Title      Gross  Gross (Adjusted)  Year
0                  Gone with the Wind  200852579        1895421694  1939
1  Star Wars: Episode IV - A New Hope  460998507        1668979715  1977
2                  The Sound of Music  159287539        1335086324  1965

In [5]:
### How about the last 5 values of a the file?
movies.tail(5)

                Title      Gross  Gross (Adjusted)  Year
195            Patton   61749765         373287682  1970
196  Fatal Attraction  156645693         371808159  1987
197        Iron Man 2  312433331         371691971  2010
198          Zootopia  341268248         371109157  2016
199         Liar Liar  181410615         370330510  1997

Use the info() method to get a quick description of the dataframe

In [6]:
### Get a quick summary of the data using the info() method
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Title             200 non-null    object
 1   Gross             200 non-null    int64
 2   Gross (Adjusted)  200 non-null    int64
 3   Year              200 non-null    int64
dtypes: int64(3), object(1)
memory usage: 6.4+ KB

# Working to filter different elements

Using iloc and loc to extract specific rows and columns

In [7]:
### Get the first 10 elements (movies) of the second column and convert it into a series with a name
ser1 = movies.iloc[:10, 1]
ser1

0    200852579
1    460998507
2    159287539
3    435110554
4    659363944
5     65500000
6    260758300
7    111721910
8    232906145
9    184925486
Name: Gross, dtype: int64

In [8]:
### Get the names of the first 10 movies and convert it into a series and give it type string
ser2 = movies.iloc[:10, 0].astype("string")
ser2

0                    Gone with the Wind
1    Star Wars: Episode IV - A New Hope
2                    The Sound of Music
3            E.T. the Extra-Terrestrial
4                               Titanic
5                  The Ten Commandments
6                                  Jaws
7                        Doctor Zhivago
8                          The Exorcist
9       Snow White and the Seven Dwarfs
Name: Title, dtype: string

In [9]:
### Create a smaller dataframe with last 20 elements and all columns except 'Year'. Give the columns new custom names (your choice).
movies.iloc[180:, 0:3]

                                        Title      Gross  Gross (Adjusted)
180                   Guardians of the Galaxy  333176600         385834112
181                                 Furious 7  353007020         384393006
182                       Mission: Impossible  180981856         383664957
183     The Hunger Games: Mockingjay - Part 1  337135885         381611053
184                                   Minions  336045770         381492054
185    Harry Potter and the Half-Blood Prince  302305431         381195025
186                      Saturday Night Fever   94213184         380466039
187                            On Golden Pond  119285432         380274891
188     Austin Powers: The Spy Who Shagged Me  206040086         380038767
189  Harry Potter and the Prisoner of Azkaban  249975996         378596724
190                            Bruce Almighty  242829261         377331774
191                                Funny Girl   52223306         375170115
192                    Mission: Impossible II  215409889         374469239
193                               Rush Hour 2  226164286         374410208
194                                 Apollo 13  173837933         373466649
195                                    Patton   61749765         373287682
196                          Fatal Attraction  156645693         371808159
197                                Iron Man 2  312433331         371691971
198                                  Zootopia  341268248         371109157
199                                 Liar Liar  181410615         370330510

Subsetting the dataframe based on conditions

In [10]:
### Create a smaller dataframe with movies made in the year 2000s
movies[movies["Year"] >= 2000]

,Title,Gross,Gross (Adjusted),Year
10,Star Wars: Episode VII - The Force Awakens,936662225,1013038487,2015
14,Avatar,760507625,911790952,2009
15,Avengers: Endgame,858373000,892669593,2019
28,The Avengers,623357910,720376844,2012
29,Jurassic World,652270625,719518552,2015
...,...,...,...,...
190,Bruce Almighty,242829261,377331774,2003
192,Mission: Impossible II,215409889,374469239,2000
193,Rush Hour 2,226164286,374410208,2001
197,Iron Man 2,312433331,371691971,2010
198,Zootopia,341268248,371109157,2016

In [11]:
### How many movies Gross (use 'Gross (Adjusted)') over 1,500,000,000?
movies[movies["Gross (Adjusted)"]>1500000000]

                                Title      Gross  Gross (Adjusted)  Year
0                  Gone with the Wind  200852579        1895421694  1939
1  Star Wars: Episode IV - A New Hope  460998507        1668979715  1977

Customizing the dataframe

In [12]:
### Use DataFrame.columns to change the column name to 'Movie','Gross', 'Gross_adj', and 'Year'
movies.columns = ["Movie", "Gross", "Gross_adj", "Year"]

In [13]:
### Set the 'Movies' column as the index
movies.set_index("Movie", inplace=True)
movies.head(3)

                                        Gross   Gross_adj  Year
Movie
Gone with the Wind                  200852579  1895421694  1939
Star Wars: Episode IV - A New Hope  460998507  1668979715  1977
The Sound of Music                  159287539  1335086324  1965

Getting some statistic about the data

In [14]:
### Get some statistical information about the 'Gross' column
movies["Gross"].describe()

count    2.000000e+02
mean     2.564920e+08
std      1.705675e+08
min      9.183673e+06
25%      1.169264e+08
50%      2.341963e+08
75%      3.633033e+08
max      9.366622e+08
Name: Gross, dtype: float64

In [15]:
### What is the average 'Gross (Adjusted)' value for Movies from the 1990s?
movies[movies["Year"] == 1990]["Gross_adj"].mean()

480388421.75

In [16]:
### What is the standard deviation of 'Gross (Adjusted)'?
movies["Gross_adj"].std()

227797683.4472427